bit-finance/InformationRegisters/ДокументыОПредстоящейПоставке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДокументыОПредстоящейПоставке</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаНалога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостояниеДОПП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланируемаяДатаВвоза</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияПодакцизногоТовара</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КБК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерДОПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

bit-finance/Enums/ВидыНалоговыхДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыНалоговыхДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АктНалоговойПроверки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктОбОбнаруженииФактовСвидетельствующихОНалоговыхПравонарушениях</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктОВоспрепятствованииДоступуДолжностныхЛицНаТерриториюИлиВПомещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МотивированноеЗаключение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалоговоеУведомление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатежныйДокумент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоручениеОбИстребованииДокументов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПостановлениеОНазначенииЭкспертизы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПостановлениеОПроведенииОсмотраТерриторийПомещенийДокументовИПредметов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПостановлениеОПроизводствеВыемкиИзъятияДокументовИПредметов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПротоколОбОзнакомленииПроверяемогоЛицаСПостановлениемОНазначенииЭкспертизы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПротоколОПроизводствеВыемкиИзъятияДокументовИПредметов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПротоколРассмотренияМатериаловНалоговойПроверки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РешениеОбОтказеВВозмещенииНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РешениеОбОтказеВВозмещенииНДСЗаявительныйПорядок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РешениеОбОтказеВВозмещенииСуммыАкциза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РешениеОбОтказеВВозмещенииСуммыНалогаНаДобавленнуюСтоимость</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РешениеОбОтказеВПривлеченииКОтветственностиЗаСовершениеНалоговогоПравонарушения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РешениеОбОтказеВПривлеченииКОтветственностиЛицаЗаНалоговоеПравонарушение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РешениеОбОтказеВПривлеченииЛицаКОтветственностиЗаНалоговоеПравонарушение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РешениеОбОтложенииРассмотренияМатериаловНалоговойПроверкиВСвязиСНеявкойЛица</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РешениеОбОтменеОбеспечительныхМер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РешениеОбОтменеРешенияОВозмещенииНДСЗаявительныйПорядок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РешениеОбОтменеРешенияОВозмещенииНДСЗаявительныйПорядокУточненнаяДекларация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РешениеОбОтменеРешенияОПривлеченииКОтветственностиФизЛица</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РешениеОВозмещенииНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РешениеОВозмещенииНДСЗаявительныйПорядок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РешениеОВозмещенииСуммыАкциза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РешениеОВозмещенииСуммыНалогаНаДобавленнуюСтоимость</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РешениеОВозобновленииИсполненияРешенийФизЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РешениеОВозобновленииПроведенияВыезднойНалоговойПроверки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РешениеОВозобновленииПроведенияВыезднойНалоговойПроверкиГруппыНалогоплательщиков</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РешениеОЗаменеОбеспечительныхМер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РешениеОПривлеченииКОтветственностиЗаНалоговоеПравонарушение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РешениеОПривлеченииКОтветственностиЗаСовершениеНалоговогоПравонарушения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РешениеОПривлеченииКУчастиюСвидетеляЭкспертаСпециалиста</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РешениеОПривлеченииЛицаКОтветственностиЗаНалоговоеПравонарушение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РешениеОПринятииОбеспечительныхМер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РешениеОПриостановленииВыезднойНалоговойПроверкиГруппыНалогоплательщиков</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РешениеОПриостановленииИсполненияРешенийФизЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РешениеОПриостановленииПроведенияВыезднойНалоговойПроверки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РешениеОПроведенииВыезднойНалоговойПроверки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РешениеОПроведенииВыезднойНалоговойПроверкиГруппыНалогоплательщиков</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РешениеОПроведенииДополнительныхМероприятийНалоговогоКонтроля</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РешениеОПродленииИлиОтказеВПродленииСроковПредставленияДокументов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СвидетельствоОПостановкеНаУчетРоссийскойОрганизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СвидетельствоОПостановкеНаУчетФизЛица</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СправкаОПроведеннойВыезднойНалоговойПроверке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребованиеОбУплатеНалогаСбораПениШтрафа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребованиеОбУплатеНалогаСбораПениШтрафаФизЛицу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребованиеОПредставленииДокументов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребованиеОПредставленииПоясненийКДекларацииНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеОВызовеНалогоплательщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеОПостановкеНаУчетРоссийскойОрганизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеОПостановкеНаУчетФизЛица</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеОСнятииСУчетаРоссийскойОрганизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеОСнятииСУчетаФизЛица</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребованиеОПредставленииУведомленияОКонтролируемыхИностранныхКомпаниях</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеОНепредставленииРасчетаПоСтраховымВзносам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребованиеОПредоставленииСтрановогоОтчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РешениеПоЖалобе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КвитанцияОПрисвоенииРНПТ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеОНаличииОснованийДляМотивированногоМнения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РешениеОПродленииСрокаНаправленияМотивированногоМнения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МотивированноеМнение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеОбИзмененииОставленииБезИзмененияМотивированногоМнения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомленияОНаличииОтсутствииНевыполненныхМотивированныхМнений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СообщениеОбИсчисленнойСуммеТранспортногоНалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СообщениеОбИсчисленнойСуммеТранспортногоИмущественногоЗемельногоНалогов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СообщениеОбИсчисленнойСуммеЗемельногоНалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СообщениеОНесоответствииТребованиямПримененияУСН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СообщениеОНарушенииСроковУведомленияОПереходеНаУСН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыручкаПоККТ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребованиеОбУплатеПоБанковскойГарантии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РешениеОВзысканииЗадолженности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоручениеНаСписаниеСуммыЗадолженности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоручениеНаПереводЭлектронныхДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РешениеОВзысканииЗадолженностиСЛицевыхСчетов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РешениеОПриостановленииСписанияЗадолженности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоручениеНаПеречислениеДенежныхСредствСДепозитногоСчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПостановлениеОНаложенииАрестаНаИмущество</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПротоколОбАрестеИмущества</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РешениеОЗаменеАрестаИмущества</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПостановлениеОбОтменеАрестаИмущества</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПостановлениеОВзысканииЗадолженностиЗаСчетИмущества</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребованиеОПеречисленииДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РезультатыОбработкиДляСоциальногоВычета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПатентНаПравоПримененияПатентнойСистемыНалогообложения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросОПредставленииДокументовИнформации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктПроверкиСделокМеждуВзаимозависимымиЛицами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РешениеОПривлеченииКОтветственностиПоРезультатамПроверкиСделок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РешениеОбОтказеВПривлеченииКОтветственностиПоРезультатамПроверкиСделок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КвитанцияОПрисвоенииСтатусаДОПП</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

bit-finance/InformationRegisters/ДокументыОПредстоящейПоставке/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Найти список ДОПП для документа
// 
// Параметры:
//  Ссылка - ДокументСсылка
// 
// Возвращаемое значение:
//  Структура - Найти ДОПП по основанию:
// 		* МассивДОПП - Массив из Структура
// 		* СуммаВсего - Число - общая фактурная стоимость ДОПП, введенных для данного документа
Функция НайтиДОПППоОснованию(Ссылка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);
	Запрос.УстановитьПараметр("ВидУведомления",  Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ДокументОПредстоящейПоставке);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УведомлениеОСпецрежимахНалогообложения.Ссылка КАК Ссылка,
	|	УведомлениеОСпецрежимахНалогообложения.Дата КАК Дата,
	|	УведомлениеОСпецрежимахНалогообложения.ДанныеУведомления КАК ДанныеУведомления
	|ИЗ
	|	Документ.УведомлениеОСпецрежимахНалогообложения КАК УведомлениеОСпецрежимахНалогообложения
	|ГДЕ
	|	УведомлениеОСпецрежимахНалогообложения.Основание = &ТекущийДокумент
	|	И УведомлениеОСпецрежимахНалогообложения.ВидУведомления = &ВидУведомления
	|	И НЕ УведомлениеОСпецрежимахНалогообложения.ПометкаУдаления";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СуммаВсего = 0;
	
	МассивДОПП = Новый Массив();
	
	Пока Выборка.Следующий() Цикл
		СтруктураЗаписи = Новый Структура();
		СтруктураЗаписи.Вставить("Ссылка", Выборка.Ссылка);
		СтруктураЗаписи.Вставить("Дата",   Выборка.Дата);
		РеквизитыДОПП = ПолучитьРеквизитыДОПП(Выборка.ДанныеУведомления);
		Если Не ЗначениеЗаполнено(РеквизитыДОПП.НомерКорректировки)
			Или РеквизитыДОПП.НомерКорректировки = "0" Тогда
			СуммаВсего = СуммаВсего + РеквизитыДОПП.ФактурнаяСтоимость;
		КонецЕсли;
		МассивДОПП.Добавить(СтруктураЗаписи);
	КонецЦикла;
	
	ИтоговыеДанные = Новый Структура();
	ИтоговыеДанные.Вставить("МассивДОПП", МассивДОПП);
	ИтоговыеДанные.Вставить("СуммаВсего", СуммаВсего);
	
	Возврат ИтоговыеДанные;
	
КонецФункции

// Получить Таблицу КБК
// 
// Параметры:
//  КодБКНДС - Строка
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Получить коды БК:
// * Код - Строка 
// * Название - Строка 
Функция ПолучитьКодыБК(КодБКНДС) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	ОтчетОбъект = РегламентированнаяОтчетностьВызовСервера.ОтчетОбъект("РегламентированныйОтчетКосвенныеНалогиТамСоюз");
	МакетСоставаПоказателей = ОтчетОбъект.ПолучитьМакет("СпискиВыбора2025Кв1");
	УстановитьПривилегированныйРежим(Ложь);
	
	Область =  МакетСоставаПоказателей.Области.Найти("КБК_Раздел2");
	
	КБКРаздел2 = Новый ТаблицаЗначений;
	КБКРаздел2.Колонки.Добавить("Код",      ОбщегоНазначения.ОписаниеТипаСтрока(20));
	КБКРаздел2.Колонки.Добавить("Название", ОбщегоНазначения.ОписаниеТипаСтрока(256));
	
	Для НомСтр = Область.Верх По Область.Низ Цикл
		КодКБК = СокрП(МакетСоставаПоказателей.Область(НомСтр, 1).Текст);
		Если Не ПустаяСтрока(КодКБК)Тогда
			Строка = КБКРаздел2.Добавить();
			Строка.Код = КодКБК;
			Строка.Название = СокрП(МакетСоставаПоказателей.Область(НомСтр, 2).Текст);
		КонецЕсли;
	КонецЦикла;
	
	Строка = КБКРаздел2.Добавить();
	Строка.Код = КодБКНДС;
	Строка.Название = НСтр("ru = 'НДС при импорте товаров из ЕАЭС';
							|en = 'НДС при импорте товаров из ЕАЭС'");
	Возврат КБКРаздел2;
	
КонецФункции

// Получить КБК в разрезе категорий для подакцизных товаров.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Получить КБКПо категориям товаров:
// * КодПодакцизногоТовара - Строка 
// * Код - Строка 
// * Название - Строка 
Функция ПолучитьКБКПоКатегориямТоваров() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	ОтчетОбъект = РегламентированнаяОтчетностьВызовСервера.ОтчетОбъект("РегламентированныйОтчетКосвенныеНалогиТамСоюз");
	МакетСоставаПоказателей = ОтчетОбъект.ПолучитьМакет("СпискиВыбора2025Кв1");
	УстановитьПривилегированныйРежим(Ложь);
	
	КБКПоКатегориямТоваров = Новый ТаблицаЗначений;
	КБКПоКатегориямТоваров.Колонки.Добавить("КодПодакцизногоТовара", ОбщегоНазначения.ОписаниеТипаСтрока(3));
	КБКПоКатегориямТоваров.Колонки.Добавить("Код",                   ОбщегоНазначения.ОписаниеТипаСтрока(20));
	КБКПоКатегориямТоваров.Колонки.Добавить("Название",              ОбщегоНазначения.ОписаниеТипаСтрока(256));
	
	Для Каждого Область Из МакетСоставаПоказателей.Области Цикл
		Если Область.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Строки 
			И СтрНайти(Область.Имя, "КБК_Р2_") > 0 Тогда
			ВерхОбласти = Область.Верх;
			НизОбласти = Область.Низ;
			Для НомСтр = ВерхОбласти По НизОбласти Цикл
				КодПоказателя = СокрП(МакетСоставаПоказателей.Область(НомСтр, 1).Текст);
				Если КодПоказателя <> "###" Тогда
					НовСтрока = КБКПоКатегориямТоваров.Добавить();
					НовСтрока.КодПодакцизногоТовара = КодПоказателя;
					НовСтрока.Название = СокрП(МакетСоставаПоказателей.Область(НомСтр, 2).Текст);
					НовСтрока.Код = Прав(СокрЛП(Область.Имя),20);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Возврат КБКПоКатегориямТоваров;
	
КонецФункции

// Загрузить номера ДОПП из ответов от ФНС
// 
// Параметры:
//  Параметры - Структура:
//  *Организация - СправочникСсылка.Организации
//  *КодБКНДС - Строка
// 
// Возвращаемое значение:
//  Булево - Получить номера ДОПП
Функция ПолучитьНомераДОПП(Параметры) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	|	ДокументыРеализацииПолномочийНалоговыхОрганов.НомерУведомления  КАК НомерУведомления,
	|	ДокументыРеализацииПолномочийНалоговыхОрганов.ДокументОснование КАК ДокументОснование,
	|	УведомлениеОСпецрежимахНалогообложения.ДанныеУведомления        КАК ДанныеУведомления,
	|	УведомлениеОСпецрежимахНалогообложения.Основание                КАК Основание
	|ПОМЕСТИТЬ ДанныеФНС
	|ИЗ
	|	Справочник.ДокументыРеализацииПолномочийНалоговыхОрганов КАК ДокументыРеализацииПолномочийНалоговыхОрганов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыОПредстоящейПоставке КАК ВключениеДОППВДекларации
	|		ПО ДокументыРеализацииПолномочийНалоговыхОрганов.НомерУведомления = ВключениеДОППВДекларации.НомерДОПП
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УведомлениеОСпецрежимахНалогообложения КАК УведомлениеОСпецрежимахНалогообложения
	|		ПО ДокументыРеализацииПолномочийНалоговыхОрганов.ДокументОснование = УведомлениеОСпецрежимахНалогообложения.Ссылка
	|ГДЕ
	|	ДокументыРеализацииПолномочийНалоговыхОрганов.ВидДокумента = &ВидДокумента
	|	И ДокументыРеализацииПолномочийНалоговыхОрганов.Организация = &Организация
	|	И ДокументыРеализацииПолномочийНалоговыхОрганов.НомерУведомления <> &ПустаяСтрока
	|	И ВключениеДОППВДекларации.НомерДОПП ЕСТЬ NULL
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеФНС.НомерУведомления  КАК НомерУведомления,
	|	ДанныеФНС.ДанныеУведомления КАК ДанныеУведомления,
	|	ДанныеФНС.ДокументОснование КАК ДокументОснование,
	|	РеестрДокументов.Контрагент.Ключ КАК Контрагент
	|ИЗ
	|	ДанныеФНС КАК ДанныеФНС
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрДокументов
	|		ПО ДанныеФНС.Основание = РеестрДокументов.Ссылка
	|";
	
	Запрос.УстановитьПараметр("Организация",  Параметры.Организация);
	Запрос.УстановитьПараметр("ПустаяСтрока", "");
	Запрос.УстановитьПараметр("ВидДокумента", Перечисления.ВидыНалоговыхДокументов.КвитанцияОПрисвоенииСтатусаДОПП);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	УстановитьПривилегированныйРежим(Ложь);

	МетаданныеРегистра    = Метаданные.РегистрыСведений.ДокументыОПредстоящейПоставке;
	ПредставлениеРегистра = МетаданныеРегистра.Представление();
	ПолноеИмяРегистра     = МетаданныеРегистра.ПолноеИмя();
	
	ДанныеИзмененились = Ложь;
	
	Пока Результат.Следующий() Цикл
		
		Если Не ЗначениеЗаполнено(Результат.ДокументОснование) Тогда
			Продолжить;
		КонецЕсли;
		
		НачатьТранзакцию();
		
		Попытка
			
			ДанныеПоНалогам = ПолучитьДанныеПоДОПП(Результат.ДанныеУведомления, Параметры.КБКПоКатегориям);
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить(ПолноеИмяРегистра);
			ЭлементБлокировки.УстановитьЗначение("Организация", Параметры.Организация);
			ЭлементБлокировки.УстановитьЗначение("НомерДОПП",   Результат.НомерУведомления);
			Блокировка.Заблокировать();
			
			ПланируемаяДатаВвоза = ДанныеПоНалогам.ПланируемаяДатаВвоза;
			
			ПараметрыЗаписи = Новый Структура();
			ПараметрыЗаписи.Вставить("Организация",          Параметры.Организация);
			ПараметрыЗаписи.Вставить("ПланируемаяДатаВвоза", ПланируемаяДатаВвоза);
			ПараметрыЗаписи.Вставить("Сумма",                ДанныеПоНалогам.СуммаНДС);
			ПараметрыЗаписи.Вставить("КБК",                  Параметры.КодБКНДС);
			ПараметрыЗаписи.Вставить("Категория",            "");
			
			ДобавитьЗаписьВРегистр(ПараметрыЗаписи, Результат);
			
			Для Каждого Строка Из ДанныеПоНалогам.ДанныеПоАкцизам Цикл
				Если Строка.СуммаАкциза > 0 Тогда
					ПараметрыЗаписи = Новый Структура();
					ПараметрыЗаписи.Вставить("Организация",          Параметры.Организация);
					ПараметрыЗаписи.Вставить("ПланируемаяДатаВвоза", ПланируемаяДатаВвоза);
					ПараметрыЗаписи.Вставить("Сумма",                Строка.СуммаАкциза);
					ПараметрыЗаписи.Вставить("КБК",                  Строка.КБКАкциза);
					ПараметрыЗаписи.Вставить("Категория",            Строка.Категория);
					ДобавитьЗаписьВРегистр(ПараметрыЗаписи, Результат);
				КонецЕсли;
			КонецЦикла;
			
			ЗафиксироватьТранзакцию();
			
			ДанныеИзмененились = Истина;
			
		Исключение
				
			ОтменитьТранзакцию();
				
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не удалось записать данные по ДОПП №%1 по причине:
				|%2';
				|en = 'Не удалось записать данные по ДОПП №%1 по причине:
				|%2'"), Результат.НомерУведомления, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ОбновлениеИнформационнойБазы.ЗаписатьОшибкуВЖурналРегистрации(
				МетаданныеРегистра,
				ПредставлениеРегистра,
				ТекстСообщения);
				
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат ДанныеИзмененились;
	
КонецФункции

// Получить показатели ДОПП хранимые в ДанныхУведомления
// 
// Параметры:
//  ДанныеУведомления - ХранилищеЗначения
//  КБКПоКатегориямТаблица - ТаблицаЗначений:
// 	* КодПодакцизногоТовара - Строка 
// 	* Код  - Строка
// Возвращаемое значение:
//  Структура - Получить данные по ДОПП:
// * СуммаНДС - Число 
// * ФактурнаяСтоимость - Число 
// * ПланируемаяДатаВвоза - Строка 
// * ДанныеПоАкцизам - ТаблицаЗначений:
// 		** СуммаАкциза - Число 
// 		** КБКАкциза  - Строка
// 		** Категория  - Строка
Функция ПолучитьДанныеПоДОПП(ДанныеУведомления, КБКПоКатегориямТаблица) Экспорт
	
	ДанныеПоНалогам = Новый Структура();
	ДанныеПоНалогам.Вставить("СуммаНДС", 0);
	ДанныеПоНалогам.Вставить("ФактурнаяСтоимость", 0);
	ДанныеПоНалогам.Вставить("ПланируемаяДатаВвоза", "");
	ДанныеПоАкцизам = Новый ТаблицаЗначений;
	ДанныеПоАкцизам.Колонки.Добавить("СуммаАкциза");
	ДанныеПоАкцизам.Колонки.Добавить("КБКАкциза");
	ДанныеПоАкцизам.Колонки.Добавить("Категория");
	ДанныеПоНалогам.Вставить("ДанныеПоАкцизам", ДанныеПоАкцизам);
	СтруктураДОПП = ДанныеУведомления.Получить();
	Титул = СтруктураДОПП.ДанныеУведомления.Титульная;
	ОсПрЗаяв = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Титул, "ОсПрЗаяв", "0"); // Особый признак заявителя 
	ДанныеПоНалогам.ПланируемаяДатаВвоза = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Титул, "ДатаВвоз", ТекущаяДатаСеанса());
	ФактурнаяСтоимость = 0;
	Если ОсПрЗаяв = "0" Тогда
		// Посчитаем сумму НДС со всех Листов Товары ДОПП
		СтраницыТовары = СтруктураДОПП.ДанныеМногостраничныхРазделов.ТоварДоговор;
		Для Каждого СтрокаТовары Из СтраницыТовары Цикл
			РеквизитыСтрТовары = СтрокаТовары.Значение;
			ФактурнаяСтоимостьТ = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(РеквизитыСтрТовары, "СтоимТов", 0);
			Если Не ЗначениеЗаполнено(ФактурнаяСтоимостьТ) Тогда
				ФактурнаяСтоимостьТ = 0;
			КонецЕсли;
			
			ФактурнаяСтоимость = ФактурнаяСтоимость + ФактурнаяСтоимостьТ;
			
			КодАкциза = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(РеквизитыСтрТовары, "КодПТ", "");
			СтрокаКБК = КБКПоКатегориямТаблица.Найти(КодАкциза, "КодПодакцизногоТовара");
			Если СтрокаКБК <> неопределено Тогда
				КБКАкциза = СтрокаКБК.Код;
			Иначе
				КБКАкциза = "";
			КонецЕсли;
			МаркируемыйТовар = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(РеквизитыСтрТовары, "МаркируемыйТовар", Ложь);
			Если ЗначениеЗаполнено(КодАкциза) И Не МаркируемыйТовар Тогда
				СтрокаАкциза = ДанныеПоАкцизам.Найти(КБКАкциза, "КБКАкциза");
				Если СтрокаАкциза = Неопределено Тогда
					СтрокаАкциза = ДанныеПоАкцизам.Добавить();
					СтрокаАкциза.КБКАкциза   = КБКАкциза;
					СтрокаАкциза.СуммаАкциза = 0;
					СтрокаАкциза.Категория = КодАкциза;
				Иначе
					СтрокаАкциза.Категория = СтрокаАкциза.Категория + ", " + КодАкциза;
				КонецЕсли;
				Если ОсПрЗаяв = "0" Тогда
					СтрокаАкциза.СуммаАкциза = СтрокаАкциза.СуммаАкциза
											+ ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(РеквизитыСтрТовары, "СумАкцизАдв", 0)
											+ ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(РеквизитыСтрТовары, "СумАкцизТв", 0);
				КонецЕсли;
			КонецЕсли;
			Если ОсПрЗаяв = "0" Тогда
				ДанныеПоНалогам.СуммаНДС = ДанныеПоНалогам.СуммаНДС + ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(РеквизитыСтрТовары, "СумНДС", 0);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ДанныеПоНалогам.ФактурнаяСтоимость = ФактурнаяСтоимость;
	
	Возврат ДанныеПоНалогам;
		
КонецФункции

// Получает КБК по Виду налога
// 
// Параметры:
//  Результат - Структура
// 
// Возвращаемое значение:
//  Строка - КБК
Функция УточнитьКБК(Результат) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	КБК = Результат.Значение;
	
	КБКПоВидуПлатежа = "";
	Для Каждого ПодвидДохода Из КБК.ПодвидыДохода Цикл
		Если ПодвидДохода.Значение.ВидПлатежа = Перечисления.ВидыПлатежейВГосБюджет.Налог Тогда
			КБКПоВидуПлатежа = КБК.Администратор + КБК.ВидДохода + ПодвидДохода.Ключ + КБК.КОСГУ;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат КБКПоВидуПлатежа;
	
КонецФункции

// Получает данные реквизитов ДОПП для документа -основания 
// 
// Параметры:
//  ПараметрыПолученияДанных - Структура:
//  *Основание - ДокументСсылка
// 
// Возвращаемое значение:
//  Структура - Заполнить список ДОПП По основанию:
// 		* НетДанныхФНС - Булево 
// 		* СписокДОПП - Массив  из Структура - см СтруктураИтоговыхДанных()
Функция ЗаполнитьСписокДОПППоОснованию(ПараметрыПолученияДанных) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	УведомлениеОСпецрежимахНалогообложения.Ссылка КАК Ссылка,
	|	ВЫРАЗИТЬ(УведомлениеОСпецрежимахНалогообложения.Комментарий КАК СТРОКА(256)) КАК Комментарий,
	|	УведомлениеОСпецрежимахНалогообложения.ДанныеУведомления КАК ДанныеУведомления,
	|	УведомлениеОСпецрежимахНалогообложения.ДатаПодписи КАК ДатаПодписи
	|ПОМЕСТИТЬ ВТУведомленияДОПП
	|ИЗ
	|	Документ.УведомлениеОСпецрежимахНалогообложения КАК УведомлениеОСпецрежимахНалогообложения
	|ГДЕ
	|	УведомлениеОСпецрежимахНалогообложения.Основание = &Основание
	|	И УведомлениеОСпецрежимахНалогообложения.ВидУведомления = &ВидУведомления
	|	И НЕ УведомлениеОСпецрежимахНалогообложения.ПометкаУдаления
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТУведомленияДОПП.Ссылка КАК Ссылка,
	|	ВТУведомленияДОПП.Комментарий КАК Комментарий,
	|	МАКСИМУМ(ДокументыРеализацииПолномочийНалоговыхОрганов.СтатусДОПП) КАК СтатусДОПП,
	|	ДокументыРеализацииПолномочийНалоговыхОрганов.НомерУведомления КАК НомерДОПП,
	|	ДокументыРеализацииПолномочийНалоговыхОрганов.ДатаУведомления КАК ДатаДОПП,
	|	МИНИМУМ(ДокументыРеализацииПолномочийНалоговыхОрганов.ДатаУведомления ЕСТЬ NULL) КАК НетДанныхФНС,
	|	ВТУведомленияДОПП.ДатаПодписи КАК ДатаПодписи
	|ИЗ
	|	ВТУведомленияДОПП КАК ВТУведомленияДОПП
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДокументыРеализацииПолномочийНалоговыхОрганов КАК ДокументыРеализацииПолномочийНалоговыхОрганов
	|		ПО ВТУведомленияДОПП.Ссылка = ДокументыРеализацииПолномочийНалоговыхОрганов.ДокументОснование
	|			И (НЕ ДокументыРеализацииПолномочийНалоговыхОрганов.ПометкаУдаления)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТУведомленияДОПП.Ссылка,
	|	ВТУведомленияДОПП.Комментарий,
	|	ДокументыРеализацииПолномочийНалоговыхОрганов.НомерУведомления,
	|	ДокументыРеализацииПолномочийНалоговыхОрганов.ДатаУведомления,
	|	ВТУведомленияДОПП.ДатаПодписи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТУведомленияДОПП.Ссылка КАК Ссылка,
	|	ВТУведомленияДОПП.ДанныеУведомления КАК ДанныеУведомления
	|ИЗ
	|	ВТУведомленияДОПП КАК ВТУведомленияДОПП";
	
	Запрос.УстановитьПараметр("Основание", ПараметрыПолученияДанных.Основание);
	Запрос.УстановитьПараметр("ВидУведомления",  Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ДокументОПредстоящейПоставке);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	ДанныеУведомлений = МассивРезультатов[2].Выгрузить();
	Результат = МассивРезультатов[1].Выбрать();
	
	СписокДОПП = Новый Массив();
	
	НетДанныхФНС = Истина;
	
	Пока Результат.Следующий() Цикл
		
		Строка = СтруктураИтоговыхДанных();
		ЗаполнитьЗначенияСвойств(Строка, Результат,,"СтатусДОПП");
		Строка.СтатусДОПП = ИнтерфейсыВзаимодействияБРОВызовСервера.СтатусыДОПП(Результат.СтатусДОПП,, Истина);
		СтрокаДанныеУведомления = ДанныеУведомлений.Найти(Результат.Ссылка);
		ДанныеДОПП = ПолучитьРеквизитыДОПП(СтрокаДанныеУведомления.ДанныеУведомления);
		Строка.ОбеспечительныйПлатеж = ДанныеДОПП.СуммаОП;
		Строка.НомерКорректировки    = ДанныеДОПП.НомерКорректировки;
		Строка.ПланируемаяДатаВвоза  = ДанныеДОПП.ПланируемаяДатаВвоза;
		Строка.ФактурнаяСтоимость    = ДанныеДОПП.ФактурнаяСтоимость;
		Если Не ЗначениеЗаполнено(Строка.НомерКорректировки) Тогда
			Строка.НомерКорректировки = "0";
		КонецЕсли;
		
		НетДанныхФНС = Мин(НетДанныхФНС, Результат.НетДанныхФНС);
		
		СписокДОПП.Добавить(Строка);
		
	КонецЦикла;
	
	ИтоговыеДанные = Новый Структура();
	ИтоговыеДанные.Вставить("НетДанныхФНС", НетДанныхФНС);
	ИтоговыеДанные.Вставить("СписокДОПП", СписокДОПП);
	
	Возврат ИтоговыеДанные;
	
КонецФункции

// Структура итоговых данных.
// 
// Возвращаемое значение:
//  Структура:
// * Ссылка - ДокументСсылка 
// * СтатусДОПП - Строка 
// * НомерДОПП - Строка 
// * ДатаДОПП - Дата  
// * ДатаПодписи - Дата
// * ОбеспечительныйПлатеж - Число 
// * НомерКорректировки - Строка 
// * Комментарий - Строка 
// * ПланируемаяДатаВвоза - Дата  
// * ФактурнаяСтоимость - Число   
Функция СтруктураИтоговыхДанных() Экспорт
	
	СтруктураИтоговыхДанных = Новый Структура;
	СтруктураИтоговыхДанных.Вставить("Ссылка", Неопределено);
	СтруктураИтоговыхДанных.Вставить("СтатусДОПП", "");
	СтруктураИтоговыхДанных.Вставить("НомерДОПП", "");
	СтруктураИтоговыхДанных.Вставить("ДатаДОПП", Дата(1,1,1));
	СтруктураИтоговыхДанных.Вставить("ДатаПодписи", Дата(1,1,1));
	СтруктураИтоговыхДанных.Вставить("ОбеспечительныйПлатеж", 0);
	СтруктураИтоговыхДанных.Вставить("НомерКорректировки", "0");
	СтруктураИтоговыхДанных.Вставить("Комментарий", "");
	СтруктураИтоговыхДанных.Вставить("ПланируемаяДатаВвоза", Дата(1,1,1));
	СтруктураИтоговыхДанных.Вставить("ФактурнаяСтоимость", 0);
	
	Возврат СтруктураИтоговыхДанных;
	
КонецФункции

// Получение акутальной формы ДОПП.
// 
// Параметры:
//  Дата - Дата
// 
// Возвращаемое значение:
//  Строка - Имя формы ДОПП
Функция ИмяФормыДОПП(Дата) Экспорт
	
	ТаблицаФорм = Отчеты.РегламентированноеУведомлениеДокументОПредстоящейПоставке.ПолучитьТаблицуФорм();
	ИмяФормы = "";
	Для Каждого Форма Из ТаблицаФорм Цикл
		Если Форма.ДатаНачала <= Дата И Форма.ДатаКонца >= Дата Тогда
			ИмяФормы = Форма.ИмяФормы;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ИмяФормы;
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьЗаписьВРегистр(ПараметрыЗаписи, Результат)
	
	НаборЗаписей = РегистрыСведений.ДокументыОПредстоящейПоставке.СоздатьНаборЗаписей();
	НаборЗаписей.Заполнить(Неопределено);
	НаборЗаписей.Отбор.Организация.Установить(ПараметрыЗаписи.Организация);
	НаборЗаписей.Отбор.НомерДОПП.Установить(Результат.НомерУведомления);
	НаборЗаписей.Отбор.КБК.Установить(ПараметрыЗаписи.КБК);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Организация = ПараметрыЗаписи.Организация;
	НоваяЗапись.НомерДОПП   = Результат.НомерУведомления;
	НоваяЗапись.Контрагент  = Результат.Контрагент;
	НоваяЗапись.СуммаНалога = ПараметрыЗаписи.Сумма;
	НоваяЗапись.КБК         = ПараметрыЗаписи.КБК;
	НоваяЗапись.ПланируемаяДатаВвоза = ПараметрыЗаписи.ПланируемаяДатаВвоза;
	НоваяЗапись.КатегорияПодакцизногоТовара = ПараметрыЗаписи.Категория;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

Функция ПолучитьРеквизитыДОПП(ДанныеУведомления)
	
	СтруктураДОПП = ДанныеУведомления.Получить();
	СуммаОП   = СтруктураДОПП.ДанныеУведомления.Титульная.СумОбПлат;
	НомКорр   = СтруктураДОПП.ДанныеУведомления.Титульная.НомКорр;
	ДатаВвоза = СтруктураДОПП.ДанныеУведомления.Титульная.ДатаВвоз;
	// Посчитаем сумму НДС со всех Листов Товары ДОПП
	СтраницыТовары = СтруктураДОПП.ДанныеМногостраничныхРазделов.ТоварДоговор;
	ФактурнаяСтоимость = 0;
	
	Для Каждого СтрокаТовары Из СтраницыТовары Цикл
		
		Если ЗначениеЗаполнено(СтрокаТовары.Значение.СтоимТов) Тогда
			ФактурнаяСтоимостьТ = СтрокаТовары.Значение.СтоимТов;
		Иначе
			ФактурнаяСтоимостьТ = 0;
		КонецЕсли;
		
		ФактурнаяСтоимость = ФактурнаяСтоимость + ФактурнаяСтоимостьТ;
		
	КонецЦикла;
	
	ДанныеДОПП = Новый Структура;
	ДанныеДОПП.Вставить("СуммаОП", СуммаОП);
	ДанныеДОПП.Вставить("НомерКорректировки",   НомКорр);
	ДанныеДОПП.Вставить("ПланируемаяДатаВвоза", ДатаВвоза);
	ДанныеДОПП.Вставить("ФактурнаяСтоимость",   ФактурнаяСтоимость);
	
	Возврат ДанныеДОПП;
		
КонецФункции

#КонецОбласти

#КонецЕсли
